###############################################################################
# Created by write_sdc
# Thu Nov  2 21:48:28 2023
###############################################################################
current_design user_project_wrapper
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {user_clock2}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {wbs_ack_o}]
set_load -pin_load 0.1900 [get_ports {analog_io[28]}]
set_load -pin_load 0.1900 [get_ports {analog_io[27]}]
set_load -pin_load 0.1900 [get_ports {analog_io[26]}]
set_load -pin_load 0.1900 [get_ports {analog_io[25]}]
set_load -pin_load 0.1900 [get_ports {analog_io[24]}]
set_load -pin_load 0.1900 [get_ports {analog_io[23]}]
set_load -pin_load 0.1900 [get_ports {analog_io[22]}]
set_load -pin_load 0.1900 [get_ports {analog_io[21]}]
set_load -pin_load 0.1900 [get_ports {analog_io[20]}]
set_load -pin_load 0.1900 [get_ports {analog_io[19]}]
set_load -pin_load 0.1900 [get_ports {analog_io[18]}]
set_load -pin_load 0.1900 [get_ports {analog_io[17]}]
set_load -pin_load 0.1900 [get_ports {analog_io[16]}]
set_load -pin_load 0.1900 [get_ports {analog_io[15]}]
set_load -pin_load 0.1900 [get_ports {analog_io[14]}]
set_load -pin_load 0.1900 [get_ports {analog_io[13]}]
set_load -pin_load 0.1900 [get_ports {analog_io[12]}]
set_load -pin_load 0.1900 [get_ports {analog_io[11]}]
set_load -pin_load 0.1900 [get_ports {analog_io[10]}]
set_load -pin_load 0.1900 [get_ports {analog_io[9]}]
set_load -pin_load 0.1900 [get_ports {analog_io[8]}]
set_load -pin_load 0.1900 [get_ports {analog_io[7]}]
set_load -pin_load 0.1900 [get_ports {analog_io[6]}]
set_load -pin_load 0.1900 [get_ports {analog_io[5]}]
set_load -pin_load 0.1900 [get_ports {analog_io[4]}]
set_load -pin_load 0.1900 [get_ports {analog_io[3]}]
set_load -pin_load 0.1900 [get_ports {analog_io[2]}]
set_load -pin_load 0.1900 [get_ports {analog_io[1]}]
set_load -pin_load 0.1900 [get_ports {analog_io[0]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[37]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[36]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[35]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[34]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[33]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[32]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[31]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[30]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[29]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[28]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[27]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[26]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[25]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[24]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[23]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[22]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[21]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[20]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[19]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[18]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[17]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[16]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[15]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[14]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[13]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[12]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[11]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[10]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[9]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[8]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[7]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[6]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[5]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[4]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[3]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[2]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[1]}]
set_load -pin_load 0.1900 [get_ports {io_oeb[0]}]
set_load -pin_load 0.1900 [get_ports {io_out[37]}]
set_load -pin_load 0.1900 [get_ports {io_out[36]}]
set_load -pin_load 0.1900 [get_ports {io_out[35]}]
set_load -pin_load 0.1900 [get_ports {io_out[34]}]
set_load -pin_load 0.1900 [get_ports {io_out[33]}]
set_load -pin_load 0.1900 [get_ports {io_out[32]}]
set_load -pin_load 0.1900 [get_ports {io_out[31]}]
set_load -pin_load 0.1900 [get_ports {io_out[30]}]
set_load -pin_load 0.1900 [get_ports {io_out[29]}]
set_load -pin_load 0.1900 [get_ports {io_out[28]}]
set_load -pin_load 0.1900 [get_ports {io_out[27]}]
set_load -pin_load 0.1900 [get_ports {io_out[26]}]
set_load -pin_load 0.1900 [get_ports {io_out[25]}]
set_load -pin_load 0.1900 [get_ports {io_out[24]}]
set_load -pin_load 0.1900 [get_ports {io_out[23]}]
set_load -pin_load 0.1900 [get_ports {io_out[22]}]
set_load -pin_load 0.1900 [get_ports {io_out[21]}]
set_load -pin_load 0.1900 [get_ports {io_out[20]}]
set_load -pin_load 0.1900 [get_ports {io_out[19]}]
set_load -pin_load 0.1900 [get_ports {io_out[18]}]
set_load -pin_load 0.1900 [get_ports {io_out[17]}]
set_load -pin_load 0.1900 [get_ports {io_out[16]}]
set_load -pin_load 0.1900 [get_ports {io_out[15]}]
set_load -pin_load 0.1900 [get_ports {io_out[14]}]
set_load -pin_load 0.1900 [get_ports {io_out[13]}]
set_load -pin_load 0.1900 [get_ports {io_out[12]}]
set_load -pin_load 0.1900 [get_ports {io_out[11]}]
set_load -pin_load 0.1900 [get_ports {io_out[10]}]
set_load -pin_load 0.1900 [get_ports {io_out[9]}]
set_load -pin_load 0.1900 [get_ports {io_out[8]}]
set_load -pin_load 0.1900 [get_ports {io_out[7]}]
set_load -pin_load 0.1900 [get_ports {io_out[6]}]
set_load -pin_load 0.1900 [get_ports {io_out[5]}]
set_load -pin_load 0.1900 [get_ports {io_out[4]}]
set_load -pin_load 0.1900 [get_ports {io_out[3]}]
set_load -pin_load 0.1900 [get_ports {io_out[2]}]
set_load -pin_load 0.1900 [get_ports {io_out[1]}]
set_load -pin_load 0.1900 [get_ports {io_out[0]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[127]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[126]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[125]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[124]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[123]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[122]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[121]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[120]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[119]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[118]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[117]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[116]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[115]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[114]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[113]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[112]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[111]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[110]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[109]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[108]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[107]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[106]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[105]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[104]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[103]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[102]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[101]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[100]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[99]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[98]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[97]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[96]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[95]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[94]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[93]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[92]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[91]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[90]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[89]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[88]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[87]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[86]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[85]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[84]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[83]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[82]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[81]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[80]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[79]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[78]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[77]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[76]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[75]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[74]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[73]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[72]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[71]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[70]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[69]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[68]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[67]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[66]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[65]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[64]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[63]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[62]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[61]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[60]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[59]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[58]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[57]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[56]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[55]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[54]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[53]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[52]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[51]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[50]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[49]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[48]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[47]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[46]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[45]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[44]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[43]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[42]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[41]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[40]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[39]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[38]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[37]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[36]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[35]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[34]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[33]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[32]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[31]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[30]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[29]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[28]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[27]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[26]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[25]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[24]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[23]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[22]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[21]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[20]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[19]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[18]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[17]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[16]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[15]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[14]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[13]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[12]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[11]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[10]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[9]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[8]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[7]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[6]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[5]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[4]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[3]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[2]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[1]}]
set_load -pin_load 0.1900 [get_ports {la_data_out[0]}]
set_load -pin_load 0.1900 [get_ports {user_irq[2]}]
set_load -pin_load 0.1900 [get_ports {user_irq[1]}]
set_load -pin_load 0.1900 [get_ports {user_irq[0]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[31]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[30]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[29]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[28]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[27]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[26]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[25]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[24]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[23]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[22]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[21]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[20]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[19]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[18]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[17]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[16]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[15]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[14]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[13]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[12]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[11]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[10]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[9]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[8]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[7]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[6]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[5]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[4]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[3]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[2]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[1]}]
set_load -pin_load 0.1900 [get_ports {wbs_dat_o[0]}]
set_input_transition 0.6100 [get_ports {user_clock2}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_fanout 16.0000 [current_design]
